Repository: deadanimal/JPJ-Flutter
Catalog: lib/l10n/app_*.arb
Languages: ms

source: Log In
ms: Log Masuk

source: User ID
ms: ID Pengguna

source: Password
ms: Kata Laluan

# forgotPassword
source: Forgot Passord?
ms: Terlupa Kata Laluan?

source: Or
ms: Atau

source: Visitor
ms: Pelawat

source: Register New Account
ms: Daftar Akaun Baharu

source: Language Setting
ms: Tetapan Bahasa

# enterEmail
source: Please enter your email address
ms: Sila masukkan alamat e-mel yang didaftarkan

# enteric
source: Please enter your IC number
ms: Sila masukkan ID pengenalan anda

source: Email address
ms: Alamat e-mel

source: Submit
ms: Hantar

# tacSubmitted
source: TAC was sent
ms: Kod TAC telah dihantar

# checkEmail
source: please check your email
ms: sila semak e-mel anda

source: TAC Code
ms: Kod TAC

# tacDescription
source: Please enter the TAC code sent to your email
ms: Sila masukkan kot TAC yang telah dihantar ke e-mel anda

source: Verify
ms: Sahkan

source: Send TAC again
ms: Hantar TAC semula

source: Change Password
ms: Tukar Kata Laluan

source: New Password
ms: Kata Laluan Baharu

source: Verify New Password
ms: Pengesahan Kata Laluan Baharu

source: Your password
ms: Kata laluan anda

source: successfully updated
ms: telah berjaya dikemas kini

source: Your password need
ms: Kata laluan anda perlu

# passwordInfo
source: to contains at least 8 characters consisting of a combination of uppercase, lowercase letters, numbers and symbols
ms: mengandungi sekurang-kurangnya 8 aksara terdiri daripada gabungan huruf besar, huruf kecil, nombor dan simbol

# tempPasswordSent
source: Temporary password sent
ms: Kata laluan sementara telah dihantar

# tncLong
source: Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur accumsan justo ante. Donec tincidunt vel urna at placerat. Vivamus fringilla eros ipsum, vitae sollicitudin mi rutrum condimentum. Aliquam sit amet porttitor lectus. Etiam tempor, turpis vitae sodales tempor, felis tortor vestibulum felis, luctus semper justo velit quis nisi. Duis vitae tortor ultricies, venenatis eros et, vestibulum odio. Mauris et neque ipsum. In hac habitasse platea dictumst. Sed in nibh ut erat ultrices tempor. Phasellus pretium sem et fringilla pharetra. Ut euismod, sem eget pretium tincidunt, ante mauris venenatis sem, at pharetra orci odio et lectus. Vivamus ornare enim elementum, finibus tellus quis, consectetur tortor. Donec ex mauris, ullamcorper sed ligula vel, laoreet sollicitudin turpis. Nulla ligula lorem, mollis in felis ac, tincidunt molestie tellus. Nunc rhoncus urna tellus, et elementum sem molestie aliquet. Integer ac est a libero vulputate facilisis. Quisque eleifend lorem ut imperdiet feugiat. Fusce pharetra, est quis euismod luctus, magna lectus tristique purus, ac aliquam mauris est condimentum metus. Duis sit amet nibh volutpat, fermentum enim ac, faucibus turpis. Nunc porta ornare purus quis dignissim. Integer nec enim finibus, convallis sapien eget, volutpat velit. Vivamus eu venenatis turpis. Sed nunc nisl, vulputate in bibendum eu, fermentum sed risus. Donec et nunc sit amet quam lacinia vulputate ac non nisi. Donec dictum justo nisl, ac porta ipsum fermentum in. Pellentesque rhoncus, risus sed blandit rutrum, metus mauris porta ligula, eget fermentum purus dolor eleifend eros. Fusce porttitor posuere turpis, ac convallis justo porttitor at. Aliquam erat volutpat. Vivamus ut metus ac nisi tempus vehicula in ut massa. Praesent suscipit placerat massa, id tempor sapien aliquet eu. Quisque dictum viverra eleifend. Donec vitae enim eu tellus efficitur interdum. Sed tristique ultrices erat at vestibulum. Morbi accumsan porttitor dolor quis posuere. Nullam at orci condimentum, luctus purus nec, suscipit arcu. Aenean at posuere risus. Proin laoreet ligula non ipsum iaculis tincidunt. Proin dui enim, volutpat et consequat non, dapibus tristique sem. Maecenas non quam suscipit, lacinia magna lacinia, tempus nisi. Nunc quis fermentum urna. Vestibulum commodo dignissim elit eu bibendum. Nulla sit amet urna massa. Proin vitae orci velit. Nulla accumsan sem vitae dui pellentesque fringilla. Proin ullamcorper, nunc at pretium mollis, erat est pretium tellus, quis bibendum quam nisi eu eros. Nullam tempus enim vitae diam lacinia convallis. Proin bibendum luctus purus ut facilisis. Vestibulum mollis finibus neque eget pellentesque. Curabitur in diam euismod, pretium diam eu, maximus arcu. Donec id tempor ante, cursus mollis lorem. Donec a neque est. In varius dignissim tellus ac interdum. Aenean vulputate, lorem non tincidunt feugiat, quam erat rutrum lacus, id aliquet nulla nunc sed odio. Integer lacinia condimentum orci ac tincidunt. Phasellus sit amet vehicula diam. Donec lacinia ante non ante pretium, ac varius lectus interdum. Sed placerat, nulla ut hendrerit aliquam, purus elit laoreet metus, ut euismod elit ex et nibh.
ms: Saya mengesahkan bahawa semua maklumat dan kenyataan yang diberikan seperti di atas adalah benar dan sah. Saya juga memahami bahawa sekiranya terdapat maklumat palsu, tidak benar dan/atau tidak lengkap, maka urusan ini akan terbatal dan saya boleh dikenakan tindakan undang-undang di bawah Seksyen 108 Akta Pengangkutan Jalan 1987 (Akta 333) dan/atau Seksyen 194 Kanun Keseksaan (Akta 574) mana-mana yang berkaitan.

# tncShort
source: Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur accumsan justo ante. Donec tincidunt vel urna at placerat. Vivamus
ms: Saya mengesahkan bahawa semua maklumat dan kenyataan yang diberikan seperti di atas adalah benar dan sah. Saya juga memahami bahawa sekiranya

# readMore
source: Next
ms: Selanjutnya

# regNewAcc
source: Register New Account
ms: Daftar Akaun Baharu

# phoneNumber
source: Phone No
ms: No. Telefon

source: Email
ms: E-mel

source: Verify Email
ms: Sahkan E-mel

# forgotPasswordDot
source: Forgot Password
ms: Terlupa Kata Laluan

source: Inbox
ms: Peti Masuk

source: Share App
ms: Kongsi Aplikasi

source: Logout
ms: Log Keluar

source: Welcome
ms: Selamat Datang

# service
source: Public
ms: Orang Awam

# favourite
source: Main Selection
ms: Pilihan Utama

# lastLoggedIn
source: Last log in
ms: Log masuk terakhir

source: Online Transaction
ms: Transaksi Atas Talian

source: Transaction History
ms: Sejarah Transaksi

# latestPlate
source: Latest Registration Number
ms: Semakan Nombor Terkini

source: Driving License
ms: Semakan Lesen Memandu

source: Test Result
ms: Semakan Keputusan Ujian

# lkm
source: Road Tax
ms: Semakan Lesen Kenderaan

# ticket
source: Summons
ms: Semakan Saman

# blacklist
source: Blacklisted Vehicle
ms: Semakan Senarai Hitam Kenderaan

source: Demerit Points
ms: Semakan Mata Demerit

source: Permanent Resident
ms: Penduduk Tetap Malaysia

source: Malaysian
ms: Orang Awam Malaysia

# police
source: Police Officer
ms: Anggota Polis

# military
source: Military Officer
ms: Anggota Tentera

source: Company
ms: Syarikat/Pertubuhan

source: Non Malaysian
ms: Bukan Warganegara Malaysia

source: Category
ms: Kategori

# drivingnLicense
source: Driving License
ms: Lesen Memandu

source: License Type
ms: Jenis Lesen

source: Expiry Date
ms: Tarikh Luput

source: Search Result
ms: Keputusan Carian

source: Name
ms: Nama

# nricNumber
source: Id Number
ms: Nombor Kad Pengenalan

source: No Record
ms: Tiada Rekod

# vehicleReg
source: Vehicle registration
ms: No Kenderaan

# latestNNumber
source: Latest Vehicle Registration
ms: Semakan Nombor Terkini

source: State
ms: Negeri

# staff
source: JPJ Staff
ms: Warga JPJ

source: Test Type
ms: Jenis Ujian

source: Test Location
ms: Lokasi Ujian

source: License Class
ms: Kelas Lesen

source: Result
ms: Keputusan

source: Test Date
ms: Tarikh Ujian

source: Start Date
ms: Tarikh Mula

# testNResult
source: Test Result
ms: Keputusan Ujian

# demeritNPoints
source: Demerit Points
ms: Semakan Mata Demerit

source: Update Profile
ms: Kemaskini Profil

# vehicleNList
source: Vehicle List
ms: Senarai Kenderaan

source: Feedback
ms: Maklum Balas

# viewTNC
source: View Terms And Conditions
ms: Paparan Terma Penggunaan

source: Details
ms: Keterangan

source: Please type here
ms: Sila taip disini

source: Your Record
ms: Rekod anda

source: Successfully saved
ms: telah berjaya disimpan

# tncN
source: Temrs and Conditions
ms: Terma Penggunaan

# vehicleListNumber
source: List of Vehicle Registration
ms: Senarai Nombor Kenderaan LKM

source: Offense
ms: Kesalahan

source: Ticket No.
ms: No. Saman

source: Date
ms: Tarikh

source: Location
ms: Lokasi

# amount
source: Amount (RM)
ms: Amaun (RM)

source: PAYMENT IN PROCESS
ms: PEMBAYARAN SEDANG DIPROSES

source: Transaction List
ms: Senarai Transaksi

source: Choose
ms: Pilih

source: Public
ms: Umum

source: Directory
ms: Direktori

# directoryN
source: JPJ Directory
ms: Direktori JPJ

# jpjLocationInAllState
source: JPJ Branch in Malaysia
ms: Cawangan JPJ Di Seluruh Negara

# operationHour
source: Operational Hour
ms: Waktu Operasi

source: Address
ms: Alamat

source: Coordinate
ms: Koordinat

source: Fax No.
ms: No. Fax

source: Add Vehicle
ms: Tambah kenderaan

source: Cancel
ms: Tutup

source: Password Change Success
ms: Kata Laluan Berjaya Ditukar

# updateNProfile
source: Update Profile
ms: Kemaskini Profil

source: Full Name
ms: Nama Penuh

source: District
ms: Daerah

source: Postcode
ms: Poskod

source: Your Profile
ms: Profil Anda

source: Transaction Date
ms: Tarikh Transaksi

source: Show Receipt
ms: Papar Resit

source: Show Document
ms: Papar Dokumen

source: Payment Method
ms: Cara Pembayaran

source: Credit Card
ms: Kredit Kad

# cardOwnerName
source: Card Owner's Name
ms: Nama Pemilik Kad

source: Card Number
ms: Nombor Kad

# verifyPayment
source: Confirm Payment of
ms: Sahkan Bayaran

source: Back
ms: Kembali

# summonsVerification
source: Ticket Verification
ms: Pengesahan Saman

# detail
source: Details
ms: Butiran

source: Time
ms: Masa

source: Summary
ms: Ringkasan

# summonCount
source: No. of ticket
ms: Bilangan saman

source: Amount Due
ms: Amaun yang perlu dibayar

source: Payment
ms: Pembayaran

source: Choose Payment Method
ms: Pilih Kaedah Pembayaran

source: Payment Mode
ms: Mod Pembayaran

source: Card Type
ms: Jenis Kad

source: *Unpaid amount
ms: *Amaun belum dibayar

# paySummon
source: Pay Summons
ms: Bayar Saman

source: Branch
ms: Cawangan

source: Transaction
ms: Transaksi

# failToFollowRedLight
source: Fail to obey red light
ms: Gagal mematuhi lampu isyarat merah

# emergencyLaneDriving
source: Driving in emergency lane
ms: Memandu di lorong kecemasan

# skipQueue
source: Skipping queue
ms: Memotong barisan

# leftOvertake
source: Overtake using left lane
ms: Memotong sebelah kiri

# doubleLineOvertake
source: Overtake on double line
ms: Memotong garisan berkembar

source: Using phone while driving
ms: Menggunakan telefon bimbit semasa memandu

# fancyPlateNumber
source: Fancy number plate
ms: Nombor pendaftaran fancy

source: Dark tint
ms: Cermin gelap

# notWearingSeatbelt
source: Not wearing seatbelt and helmet
ms: Tidak memakai tali pinggang/topi keledar

# videoPicture
source: Picture / Video
ms: Gambar / Video

source: Video Attachment
ms: Pautan Video

source: If available
ms: Jika ada

source: Event Date
ms: Tarikh Kejadian

source: Event Time
ms: Masa Kejadian

source: Latitude
ms: Latitud

source: Longitude
ms: Longitud

# shortStatement
source: Short Statement / Specific Location
ms: Keterangan Ringkas / Lokasi Terperinci

source: word(s) typed
ms: aksara dimasukkan

source: Event Location
ms: Lokasi Kejadian

source: Next
ms: Seterusnya

source: Save as Draft
ms: Simpan Draf

# yourComplaint
source: Your complaint has been sent
ms: Aduan anda telah berjaya dihantar

source: Thank You
ms: Terima Kasih

source: Draft
ms: Draf

source: Sent
ms: Hantar

source: Complaint ID
ms: ID Aduan

source: Received
ms: Terima

source: Main
ms: Utama

source: Activity
ms: Aktiviti

source: Comittee
ms: Urusetia

# staffDetail
source: Staff Details
ms: Maklumat Kakitangan

# nokp
source: NRIC
ms: No. KP

source: Section
ms: Bahagian

source: SCAN QR CODE
ms: IMBAS KOD QR

# youHaveAttandedThisActivity
source: You have attended this activity
ms: Anda telah menghadiri aktiviti ini

source: Activity List
ms: Senarai Aktiviti

source: Vanue
ms: Tempat

source: Attendance
ms: Kedatangan

source: Add Comittee
ms: Tambah Urusetia

# addComitteeInfo
source: Please enter IC number in the correct format. Example: 901234001234
ms: Sila masukkan no kad pengenalan dalam format yang betul. Contoh: 901234001234

source: Add
ms: Tambah

source: Scan QR
ms: Imbas QR

# manualRegistration
source: Manual Register
ms: Daftar Manual

source: New Activity
ms: Aktiviti Baharu

# activityName
source: Aktivity Name
ms: Nama Aktiviti

source: No. of days
ms: Bil. Hari

# noOfSessionPerDays
source: No. of session per day
ms: Bil. sesi per hari

source: Start Time
ms: Masa Mula

source: End Time
ms: Masa Tamat

# agenda
source: Details/Agenda
ms: Keterangan/Agenda

source: Invalid Qr Code
ms: Kod Qr Tidak Sah

source: Pull to refresh
ms: Tarik ke bawah untuk load semula

source: List of Complaint
ms: Senarai Aduan

source: Erase
ms: Padam

source: Event
ms: Aktiviti

source: Welcome To
ms: Selamat Datang Ke

# jpjEqTitle
source: JPJ INTEGRATED QUEUE NUMBERING SYSTEM & APPOINTMENT(JPJeQ)
ms: SISTEM NOMBOR GILIRAN TEMUJANJI & BERSEPADU JPJ (JPJeQ)

source: Get Location
ms: Dapatkan Lokasi

# scanQrInPermittedTime
source: Please scan the QR code in the permitted operating hour
ms: Sila scan kod QR didalam waktu operasi yang dibenarkan

source: Start
ms: Mula

source: End
ms: Tamat

# chooseServiceInfo
source: Please Choose Service Category. Make Sure The Service You Need Is In The Category. Refer Staff For Further Assistance.
ms: Sila pilih Kategori Perkhidmatan. Pastikan perkhidmatan yang diperlukan terdapat dalam kumpulan tersebut. Rujuk staf JPJ jika memerlukan maklumat lebih lanjut.

source: Hours
ms: Jam

source: Minutes
ms: Minit

source: Seconds
ms: Saat

source: SESSION
ms: SESI

# cancelB
source: Cancel
ms: Batal

# latestNQNumber
source: Latest Number
ms: Nombor Terkini

source: Waiting Position
ms: Kedudukan Menunggu

# estimatedWaitTime
source: Estimated Waiting Time
ms: Anggaran Masa Menunggu

# thankyouForYourPatientWaiting
source: Thank You For Your Patient.
ms: Terima kasih kerana sabar menunggu.

# yourNumberSuccessfullyCanceled
source: Your number has been successfully canceled. Please get a new number for your next transaction. Thank you for using our service
ms: Nombor anda telah berjaya dibatalkan. Sila dapatkan nombor baharu untuk urusan seterusnya. Terima kasih kerana telah menggunakan perkhidmatan kami

source: Your Number
ms: Nombor anda

source: Has Been Called
ms: telah dipanggil

source: please proceed to
ms: Sila ke

# forYourBusiness
source: for your business transaction
ms: untuk urusan anda

# thankyouForChoosingOurService
source: Thank you for using our service.
ms: Terima kasih kerana telah menggunakan perkhidmatan kami.

# registerTime
source: Registration Time
ms: Masa Daftar

# queueNumber
source: Queue No.
ms: No. Giliran

source: CancelTime
ms: Masa Batal

source: Notification
ms: Notifikasi

source: Direction
ms: Arah

# noOfWaiting
source: No. in queue
ms: Bil. Menuggu Giliran

# serviceProvided
source: Provided Service
ms: Service yang disediakan

source: Verification
ms: Pengesahan

source: Yes
ms: YA

source: No
ms: TIDAK

# areYouSureCancelQueue
source: Are you sure you want to cancel your number?
ms: Anda pasti untuk membatalkan no giliran anda?

source: Day
ms: Hari

# closed
source: Close
ms: Tutup

# previousTransaction
source: Previous Transactions
ms: Transaksi Terdahulu

# failedToRegister
source: Registration Failed
ms: Pendaftaran Gagal

# userExist
source: User existed
ms: Id telah di gunakan

source: User blocked
ms: Id telah di senarai hitam

source: Error, Please try again
ms: Ralat, Sila cuba lagi

# pleaseFillAllInfo
source: Please fill all required informations
ms: Pastikan semua maklumat telah diisi

# emailNotSame
source: Email entered not the same
ms: Emel yang dimasukkan tidak sama

# pleaseTickTnc
source: Please tick to agree terms and conditions
ms: Sila tanda pada kotak setuju terma dan syarat

# failToLogin
source: Login Failed
ms: Log Masuk Gagal

# checkLkm
source: LKM check
ms: Semak LKM

source: Remove Vehicle
ms: Hapus

# askRemove
source: Confirm Remove?
ms: Anda Pasti Hapus?

# chooseState
source: Choose a state
ms: Sila Pilih Negeri

# noLatestNumber
source: No Latest Registration Number
ms: Tiada Nombor Pendaftaran Terkini

source: Camera
ms: Kamera

source: Gallery
ms: Galeri

source: Choose From
ms: Pilih Dari

source: Committee Detail
ms: Maklumat Urusetia

source: Activity Detail
ms: Maklumat Aktiviti

source: Draft/Sent
ms: Draf/Dihantar

source: Image
ms: Gambar

source: Profile
ms: Profil

# supportServices
source: Other Services
ms: Perkhidmatan Umum

# licensesService
source: Vehicle Licensing
ms: Pelesenan Kenderaan

# driverService
source: Driver Licensing
ms: Pelesenan Pemandu

# kSection
source: JPJ Summons
ms: Saman JPJ

# idHasRecord
source: ID Already Registered
ms: ID Pengguna telah wujud

source: Please Login
ms: Sila Log Masuk

source: First Time Login
ms: Log Masuk Kali Pertama

source: First Question
ms: Soalan Pertama

source: Second Question
ms: Soalan Kedua

source: Third Question
ms: Soalan Ketiga

source: Answer
ms: Jawapan

# changePasswordOnNextPage
source: Please set your password on the next page
ms: Sila tetapkan kata laluan anda di halaman berikutnya.

# securityQuestionError
source: Please make sure all question are answered and all question are different
ms: Sila pastikan anda tidak memilih soalan yang sama dan semua soalan dijawab

# enteredPasswordNotTheSame
source: Entered password are not the same
ms: Katalaluan tidak sama

# changePaswordInfo
source: ** Password need to be changed every three (3) months
ms: ** Kata laluan perlu ditukar setiap tiga (3) bulan

source: Success
ms: Berjaya

# closeApp
source: Exit?
ms: Tutup Applikasi?

# chooseLocationOnMap
source: Tap on the map to choose location
ms: Pilih lokasi di peta

source: Choose This Location
ms: Pilih Lokasi Ini

# saveAsDraftSuccess
source: Successfully saved
ms: Berjaya disimpan

# removeFromDraft
source: Are you sure you want to remove this from draft?
ms: Anda pasti untuk hapuskan rekod?

# recordSaved
source: Record Successfully Saved
ms: Rekod Berjaya Disimpan

source: Set Password
ms: Penetapan Kata Laluan

# passwordNotComplient
source: Your password need to contains at least 8 characters consisting of a combination of uppercase, lowercase letters, numbers and symbols
ms: Kata laluan anda perlu mengandungi sekurang-kurangnya 8 aksara terdiri daripada gabungan huruf besar, huruf kecil, nombor dan simbol

source: Verify Password
ms: Sahkan Kata Laluan

# haveDemerit
source: You have demerit points. For more information please check on the public portal
ms: Anda mempunyai mata demerit. Untuk maklumat lanjut, sila semak di Portal Awam JPJ

# noDemerit
source: No demerit information.
ms: Tiada maklumat Demerit.

# fileTooBigError
source: File is larger than 20MB
ms: Fail lebih besar daripada 20MB

# updateProfileInfo
source: Please update your informations using JPJ portal
ms: Sila kemaskini maklumat anda di Portal Awam JPJ

source: Wrong password
ms: Kata laluan anda salah

source: Please wait...
ms: Sila Tunggu...
